using System;
using System.Collections.Generic;
using System.Linq;
using Newtonsoft.Json;
using System.Text.RegularExpressions;
using System.IO;

namespace UnicodeAsciiConverter
{
    public class Converter
    {
        Dictionary<string, string> ar; Dictionary<string, string> aM;
        Dictionary<string, string> aR; Dictionary<string, string> aS;

        public Converter()
        {
            string arJson = "{\r\n  \"।\": \"|\",\r\n  \"‘\": \"Ô\",\r\n  \"’\": \"Õ\",\r\n  \"“\": \"Ò\",\r\n  \"”\": \"Ó\",\r\n  \"্র্য\": \"ª¨\",\r\n  \"ম্প্র\": \"¤cÖ\",\r\n  \"র‌্য\": \"i¨\",\r\n  \"ক্ষ্ম\": \"²\",\r\n  \"ক্ক\": \"°\",\r\n  \"ক্ট\": \"±\",\r\n  \"ক্ত\": \"³\",\r\n  \"ক্ব\": \"K¡\",\r\n  \"স্ক্র\": \"¯Œ\",\r\n  \"ক্র\": \"µ\",\r\n  \"ক্ল\": \"K¬\",\r\n  \"ক্ষ\": \"¶\",\r\n  \"ক্স\": \"·\",\r\n  \"গু\": \"¸\",\r\n  \"গ্ধ\": \"»\",\r\n  \"গ্ন\": \"Mœ\",\r\n  \"গ্ম\": \"M¥\",\r\n  \"গ্ল\": \"M­\",\r\n  \"গ্রু\": \"Mªy\",\r\n  \"ঙ্ক\": \"¼\",\r\n  \"ঙ্ক্ষ\": \"•¶\",\r\n  \"ঙ্খ\": \"•L\",\r\n  \"ঙ্গ\": \"½\",\r\n  \"ঙ্ঘ\": \"•N\",\r\n  \"চ্ছ্ব\": \"”Q¡\",\r\n  \"চ্চ\": \"”P\",\r\n  \"চ্ছ\": \"”Q\",\r\n  \"চ্ঞ\": \"”T\",\r\n  \"জ্জ্ব\": \"¾¡\",\r\n  \"জ্জ\": \"¾\",\r\n  \"জ্ঝ\": \"À\",\r\n  \"জ্ঞ\": \"Á\",\r\n  \"জ্ব\": \"R¡\",\r\n  \"ঞ্চ\": \"Â\",\r\n  \"ঞ্ছ\": \"Ã\",\r\n  \"ঞ্জ\": \"Ä\",\r\n  \"ঞ্ঝ\": \"Å\",\r\n  \"ট্ট\": \"Æ\",\r\n  \"ট্ব\": \"U¡\",\r\n  \"ট্ম\": \"U¥\",\r\n  \"ড্ড\": \"Ç\",\r\n  \"ণ্ট\": \"È\",\r\n  \"ণ্ঠ\": \"É\",\r\n  \"ন্স\": \"Ý\",\r\n  \"ণ্ড\": \"Ê\",\r\n  \"ন্তু\": \"š‘\",\r\n  \"ণ্ব\": \"Y^\",\r\n  \"ত্ত্ব\": \"Ë¡\",\r\n  \"ত্ত\": \"Ë\",\r\n  \"ত্থ\": \"Ì\",\r\n  \"ত্ন\": \"Zœ\",\r\n  \"ত্ম\": \"Z¥\",\r\n  \"ন্ত্ব\": \"š—¡\",\r\n  \"ত্ব\": \"Z¡\",\r\n  \"থ্ব\": \"_¡\",\r\n  \"দ্গ\": \"˜M\",\r\n  \"দ্ঘ\": \"˜N\",\r\n  \"দ্দ\": \"Ï\",\r\n  \"দ্ধ\": \"×\",\r\n  \"দ্ব\": \"˜¡\",\r\n  \"দ্ব\": \"Ø\",\r\n  \"দ্ভ\": \"™¢\",\r\n  \"দ্ম\": \"Ù\",\r\n  \"দ্রু\": \"`ª“\",\r\n  \"ধ্ব\": \"aŸ\",\r\n  \"ধ্ম\": \"a¥\",\r\n  \"ন্ট\": \"›U\",\r\n  \"ন্ঠ\": \"Ú\",\r\n  \"ন্ড\": \"Û\",\r\n  \"ন্ত্র\": \"š¿\",\r\n  \"ন্ত\": \"š—\",\r\n  \"স্ত্র\": \"¯¿\",\r\n  \"ত্র\": \"Î\",\r\n  \"ন্থ\": \"š’\",\r\n  \"ন্দ\": \"›`\",\r\n  \"ন্দ্ব\": \"›Ø\",\r\n  \"ন্ধ\": \"Ü\",\r\n  \"ন্ন\": \"bœ\",\r\n  \"ন্ব\": \"š^\",\r\n  \"ন্ম\": \"b¥\",\r\n  \"প্ট\": \"Þ\",\r\n  \"প্ত\": \"ß\",\r\n  \"প্ন\": \"cœ\",\r\n  \"প্প\": \"à\",\r\n  \"প্ল\": \"c­\",\r\n  \"প্স\": \"á\",\r\n  \"ফ্ল\": \"d¬\",\r\n  \"ব্জ\": \"â\",\r\n  \"ব্দ\": \"ã\",\r\n  \"ব্ধ\": \"ä\",\r\n  \"ব্ব\": \"eŸ\",\r\n  \"ব্ল\": \"e­\",\r\n  \"ভ্র\": \"å\",\r\n  \"ম্ন\": \"gœ\",\r\n  \"ম্প\": \"¤ú\",\r\n  \"ম্ফ\": \"ç\",\r\n  \"ম্ব\": \"¤^\",\r\n  \"ম্ভ\": \"¤¢\",\r\n  \"ম্ভ্র\": \"¤£\",\r\n  \"ম্ম\": \"¤§\",\r\n  \"ম্ল\": \"¤­\",\r\n  \"্র\": \"ª\",\r\n  \"রু\": \"i“\",\r\n  \"রূ\": \"iƒ\",\r\n  \"ল্ক\": \"é\",\r\n  \"ল্গ\": \"ê\",\r\n  \"ল্ট\": \"ë\",\r\n  \"ল্ড\": \"ì\",\r\n  \"ল্প\": \"í\",\r\n  \"ল্ফ\": \"î\",\r\n  \"ল্ব\": \"j¦\",\r\n  \"ল্ম\": \"j¥\",\r\n  \"ল্ল\": \"j­\",\r\n  \"শু\": \"ï\",\r\n  \"শ্চ\": \"ð\",\r\n  \"শ্ন\": \"kœ\",\r\n  \"শ্ব\": \"k¦\",\r\n  \"শ্ম\": \"k¥\",\r\n  \"শ্ল\": \"k­\",\r\n  \"ষ্ক\": \"®‹\",\r\n  \"ষ্ক্র\": \"®Œ\",\r\n  \"ষ্ট\": \"ó\",\r\n  \"ষ্ঠ\": \"ô\",\r\n  \"ষ্ণ\": \"ò\",\r\n  \"ষ্প\": \"®ú\",\r\n  \"ষ্ফ\": \"õ\",\r\n  \"ষ্ম\": \"®§\",\r\n  \"স্ক\": \"¯‹\",\r\n  \"স্ট\": \"÷\",\r\n  \"স্খ\": \"ö\",\r\n  \"স্ত\": \"¯—\",\r\n  \"স্তু\": \"¯‘\",\r\n  \"স্থ\": \"¯’\",\r\n  \"স্ন\": \"mœ\",\r\n  \"স্প\": \"¯ú\",\r\n  \"স্ফ\": \"ù\",\r\n  \"স্ব\": \"¯^\",\r\n  \"স্ম\": \"¯§\",\r\n  \"স্ল\": \"¯­\",\r\n  \"হু\": \"û\",\r\n  \"হ্ণ\": \"nè\",\r\n  \"হ্ব\": \"nŸ\",\r\n  \"হ্ন\": \"ý\",\r\n  \"হ্ম\": \"þ\",\r\n  \"হ্ল\": \"n¬\",\r\n  \"হৃ\": \"ü\",\r\n  \"র্\": \"©\",\r\n  \"্র\": \"«\",\r\n  \"্য\": \"¨\",\r\n  \"্\": \"&\",\r\n  \"আ\": \"Av\",\r\n  \"অ\": \"A\",\r\n  \"ই\": \"B\",\r\n  \"ঈ\": \"C\",\r\n  \"উ\": \"D\",\r\n  \"ঊ\": \"E\",\r\n  \"ঋ\": \"F\",\r\n  \"এ\": \"G\",\r\n  \"ঐ\": \"H\",\r\n  \"ও\": \"I\",\r\n  \"ঔ\": \"J\",\r\n  \"ক\": \"K\",\r\n  \"খ\": \"L\",\r\n  \"গ\": \"M\",\r\n  \"ঘ\": \"N\",\r\n  \"ঙ\": \"O\",\r\n  \"চ\": \"P\",\r\n  \"ছ\": \"Q\",\r\n  \"জ\": \"R\",\r\n  \"ঝ\": \"S\",\r\n  \"ঞ\": \"T\",\r\n  \"ট\": \"U\",\r\n  \"ঠ\": \"V\",\r\n  \"ড\": \"W\",\r\n  \"ঢ\": \"X\",\r\n  \"ণ\": \"Y\",\r\n  \"ত\": \"Z\",\r\n  \"থ\": \"_\",\r\n  \"দ\": \"`\",\r\n  \"ধ\": \"a\",\r\n  \"ন\": \"b\",\r\n  \"প\": \"c\",\r\n  \"ফ\": \"d\",\r\n  \"ব\": \"e\",\r\n  \"ভ\": \"f\",\r\n  \"ম\": \"g\",\r\n  \"য\": \"h\",\r\n  \"র\": \"i\",\r\n  \"ল\": \"j\",\r\n  \"শ\": \"k\",\r\n  \"ষ\": \"l\",\r\n  \"স\": \"m\",\r\n  \"হ\": \"n\",\r\n  \"ড়\": \"o\",\r\n  \"ঢ়\": \"p\",\r\n  \"য়\": \"q\",\r\n  \"ৎ\": \"r\",\r\n  \"০\": \"0\",\r\n  \"১\": \"1\",\r\n  \"২\": \"2\",\r\n  \"৩\": \"3\",\r\n  \"৪\": \"4\",\r\n  \"৫\": \"5\",\r\n  \"৬\": \"6\",\r\n  \"৭\": \"7\",\r\n  \"৮\": \"8\",\r\n  \"৯\": \"9\",\r\n  \"া\": \"v\",\r\n  \"ি\": \"w\",\r\n  \"ী\": \"x\",\r\n  \"ু\": \"y\",\r\n  \"ূ\": \"~\",\r\n  \"ৃ\": \"…\",\r\n  \"ে\": \"‡\",\r\n  \"ৈ\": \"‰\",\r\n  \"ৗ\": \"Š\",\r\n  \"ং\": \"s\",\r\n  \"ঃ\": \"t\",\r\n  \"ঁ\": \"u\"\r\n}";
            string arrJson = "{\r\n  \"্র্য\": \"Ûø\",\r\n  \"র‌্য\": \"kø\",\r\n  \"ক্ষ্ম\": \"qô\",\r\n  \"ক্ক\": \"~\",\r\n  \"ক্ট\": \"ƒ\",\r\n  \"ক্ত\": \"£ß\",\r\n  \"ক্ব\": \"Kò\",\r\n  \"স্ক্র\": \"Ç\",\r\n  \"ক্র\": \"¢ß\",\r\n  \"ক্ষ্ম\": \"qô\",\r\n  \"ক্ষ\": \"q\",\r\n  \"ক্স\": \"…\",\r\n  \"ক্ল\": \"Kõ\",\r\n  \"গু\": \"†\",\r\n  \"গ্গ\": \"‡\",\r\n  \"গ্ধ\": \"ˆ\",\r\n  \"গ্ন\": \"Mí\",\r\n  \"গ্ম\": \"Mô\",\r\n  \"গ্ল\": \"Mö\",\r\n  \"ঙ্ক\": \"‰\",\r\n  \"ঙ্ক্ষ\": \"áq\",\r\n  \"ঙ্খ\": \"áL\",\r\n  \"ঙ্গ\": \"Š\",\r\n  \"ঙ্ঘ\": \"áN\",\r\n  \"চ্ছ্ব\": \"âQò\",\r\n  \"চ্চ\": \"âP\",\r\n  \"চ্ছ\": \"âQ\",\r\n  \"জ্জ্ব\": \"Œò\",\r\n  \"জ্জ\": \"Œ\",\r\n  \"জ্ঞ\": \"š\",\r\n  \"জ্ব\": \"Rò\",\r\n  \"ঞ্চ\": \"é\",\r\n  \"˜\": \"ঞ্ছ\",\r\n  \"ঞ্জ\": \"™\",\r\n  \"ঞ্ঝ\": \"ã\",\r\n  \"ট্ট\": \"›\",\r\n  \"ট্ব\": \"Uò\",\r\n  \"ট্ম\": \"Uô\",\r\n  \"ড্ড\": \"œ\",\r\n  \"ণ্ঠ\": \"Ÿ\",\r\n  \"ন্ঠ\": \"ª\",\r\n  \"ন্স\": \"Ý\",\r\n  \"ণ্ড\": \"¡\",\r\n  \"ন্ত্ব\": \"ìòæ\",\r\n  \"ন্তু\": \"š‘\",\r\n  \"ন্তু\": \"ìç\",\r\n  \"ণ্ব\": \"Yð\",\r\n  \"ত্ত্ব\": \"£ò\",\r\n  \"ত্থ\": \"¤\",\r\n  \"ত্ন\": \"Zí\",\r\n  \"ত্ম\": \"£ô\",\r\n  \"ত্ম\": \"Zô\",\r\n  \"ত্ত\": \"£\",\r\n  \"ত্ব\": \"Zò\",\r\n  \"থ্ব\": \"aò\",\r\n  \"দ্দ\": \"¥\",\r\n  \"দ্ধ\": \"¦\",\r\n  \"দ্ব\": \"§\",\r\n  \"দ্ভ\": \"¨\",\r\n  \"দ্ম\": \"bô\",\r\n  \"ধ্ব\": \"cµ\",\r\n  \"ন্ট\": \"ëU\",\r\n  \"ন্ট\": \"åU\",\r\n  \"ন্ড\": \"«\",\r\n  \"ন্ত্র\": \"ìè\",\r\n  \"ন্ত\": \"ìæ\",\r\n  \"স্ত্র\": \"þè\",\r\n  \"ত্র\": \"¢\",\r\n  \"ন্দ\": \"ëb\",\r\n  \"ন্দ্ব\": \"ë§\",\r\n  \"ন্ধ\": \"¬\",\r\n  \"ন্ধ\": \"ëc\",\r\n  \"ন্ন\": \"Ò\",\r\n  \"ন্ন\": \"dí\",\r\n  \"ন্ব\": \"ìñ\",\r\n  \"ন্থ\": \"ìÿ\",\r\n  \"ন্ম\": \"dô\",\r\n  \"ন্স\": \"ëo\",\r\n  \"প্ট\": \"ïU\",\r\n  \"প্ত\": \"®\",\r\n  \"প্ন\": \"eí\",\r\n  \"প্প\": \"¯\",\r\n  \"প্ল\": \"eö\",\r\n  \"ফ্ল\": \"d¬\",\r\n  \"ব্জ\": \"±\",\r\n  \"ব্দ\": \"²\",\r\n  \"ব্ধ\": \"³\",\r\n  \"ব্ব\": \"gµ\",\r\n  \"ব্ল\": \"gö\",\r\n  \"ম্ভ্র\": \"»\",\r\n  \"ভ্র\": \"¸\",\r\n  \"ম্ন\": \"ií\",\r\n  \"ম্প\": \"óe\",\r\n  \"ম্ফ\": \"óf\",\r\n  \"ম্ব\": \"¹\",\r\n  \"ম্ভ\": \"º\",\r\n  \"ম্ম\": \"ói\",\r\n  \"ম্ল\": \"óö\",\r\n  \"ল্ক\": \"¿\",\r\n  \"ল্গ\": \"ùM\",\r\n  \"ল্ট\": \"ùU\",\r\n  \"ল্ড\": \"À\",\r\n  \"ল্প\": \"ùe\",\r\n  \"ল্ফ\": \"ùf\",\r\n  \"ল্ব\": \"lð\",\r\n  \"ল্ম\": \"lô\",\r\n  \"ল্ল\": \"Á\",\r\n  \"শু\": \"Â\",\r\n  \"শ্চ\": \"úP\",\r\n  \"শ্ন\": \"mí\",\r\n  \"শ্ব\": \"mð\",\r\n  \"শ্ম\": \"mô\",\r\n  \"শ্ল\": \"mö\",\r\n  \"ষ্ক\": \"ûK\",\r\n  \"ষ্ক্র\": \"û¢ß\",\r\n  \"ষ্ট\": \"Ä\",\r\n  \"ষ্ঠ\": \"Å\",\r\n  \"ষ্প\": \"ûe\",\r\n  \"ষ্ফ\": \"üf\",\r\n  \"ষ্ম\": \"ûô\",\r\n  \"স্ক\": \"Æ\",\r\n  \"স্খ\": \"ýL\",\r\n  \"স্ট\": \"ýU\",\r\n  \"স্থ\": \"þÿ\",\r\n  \"স্ত\": \"þæ\",\r\n  \"স্তু\": \"þç\",\r\n  \"স্ন\": \"þí\",\r\n  \"স্প\": \"þe\",\r\n  \"স্ফ\": \"ýf\",\r\n  \"স্ব\": \"È\",\r\n  \"স্ব\": \"þñ\",\r\n  \"স্ম\": \"þô\",\r\n  \"হু\": \"É\",\r\n  \"হ্ণ\": \"pî\",\r\n  \"হ্ন\": \"pß\",\r\n  \"হ্ব\": \"pµ\",\r\n  \"হ্ম\": \"Ê\",\r\n  \"হ্ল\": \"n¬\",\r\n  \"হ্ল\": \"põ\",\r\n  \"হৃ\": \"pÕ\",\r\n  \"ব\": \"ò\",\r\n  \"র্\": \"ê\",\r\n  \"্র\": \"Þ\",\r\n  \"্য\": \"ø\",\r\n  \"্\": \"z\",\r\n  \"আ\": \"Aw\",\r\n  \"অ\": \"A\",\r\n  \"ই\": \"B\",\r\n  \"ঈ\": \"C\",\r\n  \"উ\": \"D\",\r\n  \"ঊ\": \"E\",\r\n  \"ঋ\": \"F\",\r\n  \"এ\": \"G\",\r\n  \"ঐ\": \"H\",\r\n  \"ও\": \"I\",\r\n  \"ঔ\": \"J\",\r\n  \"ক\": \"K\",\r\n  \"খ\": \"L\",\r\n  \"গ\": \"M\",\r\n  \"ঘ\": \"N\",\r\n  \"ঙ\": \"O\",\r\n  \"চ\": \"P\",\r\n  \"ছ\": \"Q\",\r\n  \"জ\": \"R\",\r\n  \"ঝ\": \"S\",\r\n  \"ঞ\": \"T\",\r\n  \"ট\": \"U\",\r\n  \"ঠ\": \"V\",\r\n  \"ড\": \"W\",\r\n  \"ঢ\": \"X\",\r\n  \"ণ\": \"Y\",\r\n  \"ত\": \"Z\",\r\n  \"থ\": \"¤\",\r\n  \"দ\": \"b\",\r\n  \"ধ\": \"c\",\r\n  \"ন\": \"d\",\r\n  \"প\": \"e\",\r\n  \"ফ\": \"f\",\r\n  \"ব\": \"g\",\r\n  \"ভ\": \"h\",\r\n  \"ম\": \"i\",\r\n  \"য\": \"j\",\r\n  \"র\": \"k\",\r\n  \"ল\": \"l\",\r\n  \"শ\": \"m\",\r\n  \"ষ\": \"n\",\r\n  \"স\": \"o\",\r\n  \"হ\": \"p\",\r\n  \"ড়\": \"r\",\r\n  \"ঢ়\": \"s\",\r\n  \"য়\": \"t\",\r\n  \"থ\": \"a\",\r\n  \"ৎ\": \"u\",\r\n  \"ং\": \"v\",\r\n  \"ঁ\": \"^\",\r\n  \"ঃ\": \"\\\\:\",\r\n  \"০\": \"0\",\r\n  \"১\": \"1\",\r\n  \"২\": \"2\",\r\n  \"৩\": \"3\",\r\n  \"৪\": \"4\",\r\n  \"৫\": \"5\",\r\n  \"৬\": \"6\",\r\n  \"৭\": \"7\",\r\n  \"৮\": \"8\",\r\n  \"৯\": \"9\",\r\n  \"া\": \"w\",\r\n  \"ি\": \"x\",\r\n  \"ী\": \"y\",\r\n  \"ু\": \"×\",\r\n  \"ূ\": \"Ô\",\r\n  \"ৃ\": \"Ú\",\r\n  \"ে\": \"Ë\",\r\n  \"ৈ\": \"Ð\",\r\n  \"ৗ\": \"#\",\r\n  \"।\": \"„\"\r\n}";
            string amJson = "{\r\n  \"।\": \"|\",\r\n  \"‘\": \"Ô\",\r\n  \"’\": \"Õ\",\r\n  \"“\": \"Ò\",\r\n  \"”\": \"Ó\",\r\n  \"্র্য\": \"ª¨\",\r\n  \"ম্প্র\": \"¤cÖ\",\r\n  \"র‌্য\": \"i¨\",\r\n  \"ক্ষ্ম\": \"²\",\r\n  \"ক্ক\": \"°\",\r\n  \"ক্ট\": \"±\",\r\n  \"ক্ত\": \"³\",\r\n  \"ক্ব\": \"K¡\",\r\n  \"স্ক্র\": \"¯Œ\",\r\n  \"ক্র\": \"µ\",\r\n  \"ক্ল\": \"K¬\",\r\n  \"ক্ষ\": \"¶\",\r\n  \"ক্স\": \"·\",\r\n  \"গু\": \"¸\",\r\n  \"গ্ধ\": \"»\",\r\n  \"গ্ন\": \"Mœ\",\r\n  \"গ্ম\": \"M¥\",\r\n  \"গ্ল\": \"M­\",\r\n  \"গ্রু\": \"Mªy\",\r\n  \"ঙ্ক\": \"¼\",\r\n  \"ঙ্ক্ষ\": \"•¶\",\r\n  \"ঙ্খ\": \"•L\",\r\n  \"ঙ্গ\": \"½\",\r\n  \"ঙ্ঘ\": \"•N\",\r\n  \"চ্ছ্ব\": \"”Q¡\",\r\n  \"চ্চ\": \"”P\",\r\n  \"চ্ছ\": \"”Q\",\r\n  \"চ্ঞ\": \"”T\",\r\n  \"জ্জ্ব\": \"¾¡\",\r\n  \"জ্জ\": \"¾\",\r\n  \"জ্ঝ\": \"À\",\r\n  \"জ্ঞ\": \"Á\",\r\n  \"জ্ব\": \"R¡\",\r\n  \"ঞ্চ\": \"Â\",\r\n  \"ঞ্ছ\": \"Ã\",\r\n  \"ঞ্জ\": \"Ä\",\r\n  \"ঞ্ঝ\": \"Å\",\r\n  \"ট্ট\": \"Æ\",\r\n  \"ট্ব\": \"U¡\",\r\n  \"ট্ম\": \"U¥\",\r\n  \"ড্ড\": \"Ç\",\r\n  \"ণ্ট\": \"È\",\r\n  \"ণ্ঠ\": \"É\",\r\n  \"ন্স\": \"Ý\",\r\n  \"ণ্ড\": \"Ê\",\r\n  \"ন্তু\": \"š‘\",\r\n  \"ণ্ব\": \"Y^\",\r\n  \"ত্ত্ব\": \"Ë¡\",\r\n  \"ত্ত\": \"Ë\",\r\n  \"ত্থ\": \"Ì\",\r\n  \"ত্ম\": \"Z¥\",\r\n  \"ত্ন\": \"Zœ\",\r\n  \"ন্ত্ব\": \"š—¡\",\r\n  \"ত্ব\": \"Z¡\",\r\n  \"থ্ব\": \"_¡\",\r\n  \"দ্গ\": \"˜M\",\r\n  \"দ্ঘ\": \"˜N\",\r\n  \"দ্দ\": \"Ï\",\r\n  \"দ্ধ\": \"×\",\r\n  \"দ্ব\": \"˜¡\",\r\n  \"দ্ব\": \"Ø\",\r\n  \"দ্ভ\": \"™¢\",\r\n  \"দ্ম\": \"Ù\",\r\n  \"দ্রু\": \"`ª“\",\r\n  \"ধ্ব\": \"aŸ\",\r\n  \"ধ্ম\": \"a¥\",\r\n  \"ন্ট\": \"›U\",\r\n  \"ন্ড\": \"Û\",\r\n  \"ন্ত্র\": \"š¿\",\r\n  \"ন্ত\": \"š—\",\r\n  \"স্ত্র\": \"¯¿\",\r\n  \"ত্র\": \"Î\",\r\n  \"ন্থ\": \"š’\",\r\n  \"ন্দ\": \"›`\",\r\n  \"ন্দ্ব\": \"›Ø\",\r\n  \"ন্ধ\": \"Ü\",\r\n  \"ন্ন\": \"bœ\",\r\n  \"ন্ব\": \"š^\",\r\n  \"ন্ম\": \"b¥\",\r\n  \"প্ট\": \"Þ\",\r\n  \"প্ত\": \"ß\",\r\n  \"প্ন\": \"cœ\",\r\n  \"প্প\": \"à\",\r\n  \"প্ল\": \"c­\",\r\n  \"প্স\": \"á\",\r\n  \"ফ্ল\": \"d¬\",\r\n  \"ব্জ\": \"â\",\r\n  \"ব্দ\": \"ã\",\r\n  \"ব্ধ\": \"ä\",\r\n  \"ব্ব\": \"eŸ\",\r\n  \"ব্ল\": \"e­\",\r\n  \"ভ্র\": \"å\",\r\n  \"ম্ন\": \"gœ\",\r\n  \"ম্প\": \"¤ú\",\r\n  \"ম্ফ\": \"ç\",\r\n  \"ম্ব\": \"¤^\",\r\n  \"ম্ভ\": \"¤¢\",\r\n  \"ম্ভ্র\": \"¤£\",\r\n  \"ম্ম\": \"¤§\",\r\n  \"ম্ল\": \"¤­\",\r\n  \"্র\": \"ª\",\r\n  \"রু\": \"i“\",\r\n  \"রূ\": \"iƒ\",\r\n  \"ল্ক\": \"é\",\r\n  \"ল্গ\": \"ê\",\r\n  \"ল্ট\": \"ë\",\r\n  \"ল্ড\": \"ì\",\r\n  \"ল্প\": \"í\",\r\n  \"ল্ফ\": \"î\",\r\n  \"ল্ব\": \"j¦\",\r\n  \"ল্ম\": \"j¥\",\r\n  \"ল্ল\": \"j­\",\r\n  \"শু\": \"ï\",\r\n  \"শ্চ\": \"ð\",\r\n  \"শ্ন\": \"kœ\",\r\n  \"শ্ব\": \"k¦\",\r\n  \"শ্ম\": \"k¥\",\r\n  \"শ্ল\": \"k­\",\r\n  \"ষ্ক\": \"®‹\",\r\n  \"ষ্ক্র\": \"®Œ\",\r\n  \"ষ্ট\": \"ó\",\r\n  \"ষ্ঠ\": \"ô\",\r\n  \"ষ্ণ\": \"ò\",\r\n  \"ষ্প\": \"®ú\",\r\n  \"ষ্ফ\": \"õ\",\r\n  \"ষ্ম\": \"®§\",\r\n  \"স্ক\": \"¯‹\",\r\n  \"স্ট\": \"÷\",\r\n  \"স্খ\": \"ö\",\r\n  \"স্ত\": \"¯—\",\r\n  \"স্তু\": \"¯‘\",\r\n  \"স্থ\": \"¯’\",\r\n  \"স্ন\": \"mœ\",\r\n  \"স্প\": \"¯ú\",\r\n  \"স্ফ\": \"ù\",\r\n  \"স্ব\": \"¯^\",\r\n  \"স্ম\": \"¯§\",\r\n  \"স্ল\": \"¯­\",\r\n  \"হ্ণ\": \"nè\",\r\n  \"হ্ব\": \"nŸ\",\r\n  \"হ্ন\": \"ý\",\r\n  \"হ্ম\": \"þ\",\r\n  \"হু\": \"û\",\r\n  \"হ্ল\": \"n¬\",\r\n  \"হৃ\": \"ü\",\r\n  \"র্\": \"©\",\r\n  \"্র\": \"Ö\",\r\n  \"্য\": \"¨\",\r\n  \"্\": \"&\",\r\n  \"আ\": \"Av\",\r\n  \"অ\": \"A\",\r\n  \"ই\": \"B\",\r\n  \"ঈ\": \"C\",\r\n  \"উ\": \"D\",\r\n  \"ঊ\": \"E\",\r\n  \"ঋ\": \"F\",\r\n  \"এ\": \"G\",\r\n  \"ঐ\": \"H\",\r\n  \"ও\": \"I\",\r\n  \"ঔ\": \"J\",\r\n  \"ক\": \"K\",\r\n  \"খ\": \"L\",\r\n  \"গ\": \"M\",\r\n  \"ঘ\": \"N\",\r\n  \"ঙ\": \"O\",\r\n  \"চ\": \"P\",\r\n  \"ছ\": \"Q\",\r\n  \"জ\": \"R\",\r\n  \"ঝ\": \"S\",\r\n  \"ঞ\": \"T\",\r\n  \"ট\": \"U\",\r\n  \"ঠ\": \"V\",\r\n  \"ড\": \"W\",\r\n  \"ঢ\": \"X\",\r\n  \"ণ\": \"Y\",\r\n  \"ত\": \"Z\",\r\n  \"থ\": \"_\",\r\n  \"দ\": \"`\",\r\n  \"ধ\": \"a\",\r\n  \"ন\": \"b\",\r\n  \"প\": \"c\",\r\n  \"ফ\": \"d\",\r\n  \"ব\": \"e\",\r\n  \"ভ\": \"f\",\r\n  \"ম\": \"g\",\r\n  \"য\": \"h\",\r\n  \"র\": \"i\",\r\n  \"ল\": \"j\",\r\n  \"শ\": \"k\",\r\n  \"ষ\": \"l\",\r\n  \"স\": \"m\",\r\n  \"হ\": \"n\",\r\n  \"ড়\": \"o\",\r\n  \"ঢ়\": \"p\",\r\n  \"য়\": \"q\",\r\n  \"ৎ\": \"r\",\r\n  \"০\": \"0\",\r\n  \"১\": \"1\",\r\n  \"২\": \"2\",\r\n  \"৩\": \"3\",\r\n  \"৪\": \"4\",\r\n  \"৫\": \"5\",\r\n  \"৬\": \"6\",\r\n  \"৭\": \"7\",\r\n  \"৮\": \"8\",\r\n  \"৯\": \"9\",\r\n  \"া\": \"v\",\r\n  \"ি\": \"w\",\r\n  \"ী\": \"x\",\r\n  \"ু\": \"y\",\r\n  \"ূ\": \"~\",\r\n  \"ৃ\": \"„\",\r\n  \"ে\": \"‡\",\r\n  \"ৈ\": \"‰\",\r\n  \"ৗ\": \"Š\",\r\n  \"ং\": \"s\",\r\n  \"ঃ\": \"t\",\r\n  \"ঁ\": \"u\"\r\n}";
            string asJson = "{\r\n  \"ন্ত্র\": \"ੰ੬\",\r\n  \"ক্র\": \"ਠઙ\",\r\n  \"ষ্ট্র\": \"ੈચ\",\r\n  \"স্ক্র\": \"੍\",\r\n  \"ক্ত\": \"ਡઙ\",\r\n  \"র‌্য\": \"রઘ\",\r\n  \"স্ক\": \"ੌ\",\r\n  \"ঙ্গ\": \"ਔ\",\r\n  \"ঙ্ক\": \"ਓ\",\r\n  \"ষ্ঠ\": \"ੋ\",\r\n  \"ষ্ট\": \"ੈ\",\r\n  \"ত্র\": \"੬\",\r\n  \"ত্র\": \"ਠ\",\r\n  \"ক্ষ\": \"ਉ\",\r\n  \"ঞ্জ\": \"ਙ\",\r\n  \"দ্দ\": \"ਣ\",\r\n  \"প্ত\": \"ਮ\",\r\n  \"ত্ত\": \"ਡ\",\r\n  \"দ্ব\": \"ਦ\",\r\n  \"দ্ধ\": \"ਤ\",\r\n  \"ন্ড\": \"ਫ\",\r\n  \"ম্ব\": \"ਹ\",\r\n  \"ম্ন\": \"ઃੱ\",\r\n  \"ম্ভ\": \"਼\",\r\n  \"জ্ঞ\": \"ਛ\",\r\n  \"জ্জ\": \"ਕ\",\r\n  \"ন্ধ\": \"ਬ\",\r\n  \"ন্ব\": \"নੴ\",\r\n  \"ট্ট\": \"ਜ\",\r\n  \"ন্ঠ\": \"ਞ\",\r\n  \"ন্ত\": \"ੰ੪\",\r\n  \"ল্ড\": \"ੀ\",\r\n  \"ল্ক\": \"ਿ\",\r\n  \"ক্স\": \"ਈ\",\r\n  \"ণ্ড\": \"ਟ\",\r\n  \"ন্ড\": \"ਫ\",\r\n  \"ক্ট\": \"ਇ\",\r\n  \"দ্র\": \"ਨ\",\r\n  \"ব্দ\": \"ਲ਼\",\r\n  \"ল্ল\": \"ੁ\",\r\n  \"স্ব\": \"ਖ਼\",\r\n  \"ন্ন\": \"ਭ\",\r\n  \"ঞ্চ\": \"ਗ\",\r\n  \"ষ্ক\": \"ઊ\",\r\n  \"ড়্গ\": \"ੜ\",\r\n  \"ড্ড\": \"ਝ\",\r\n  \"ভ্র\": \"ਸ\",\r\n  \"স্ত\": \"એ੪\",\r\n  \"স্থ\": \"એઐ\",\r\n  \"ফ্র\": \"ਰ\",\r\n  \"গ্ধ\": \"ਐ\",\r\n  \"প্প\": \"ਯ\",\r\n  \"দ্ভ\": \"ਧ\",\r\n  \"ব্ধ\": \"ਵ\",\r\n  \"ঞ্ছ\": \"ਘ\",\r\n  \"ষ্ণ\": \"ষ੨\",\r\n  \"হ্র\": \"হછ\",\r\n  \"ূ\": \"ખ\",\r\n  \"্য\": \"ઘ\",\r\n  \"ন্\": \"੯\",\r\n  \"ণ্\": \"੩\",\r\n  \"ঙ্\": \"੦\",\r\n  \"র্\": \"ગ\",\r\n  \"শ্\": \"ઉ\",\r\n  \"স্\": \"એ\",\r\n  \"্ন\": \"ੱ\",\r\n  \"ম্\": \"ઃ\",\r\n  \"্ম\": \"અ\",\r\n  \"চ্\": \"੧\",\r\n  \"্ব\": \"ં\",\r\n  \"্ল\": \"આ\",\r\n  \"ল্\": \"ઈ\",\r\n  \"্থ\": \"ઐ\",\r\n  \"্র\": \"ઝ\",\r\n  \"ৎ\": \"ਅ\",\r\n  \"৯\": \"ঌ\",\r\n  \"ু\": \"ઓ\",\r\n  \"ৈ\": \"ৌ\",\r\n  \"ৃ\": \"ৄ\",\r\n  \"গু\": \"ਊ\",\r\n  \"তু\": \"੫\",\r\n  \"ত্থ\": \"ਢ\",\r\n  \"হু\": \"ਗ਼\",\r\n  \"।\": \"৷\",\r\n  \"\\\"\": \"�\",\r\n  \"\\\\,\": \"৴\",\r\n  \"\\\\'\": \"৸\",\r\n  \"\\\\!\": \"৲\",\r\n  \"\\\\;\": \"৵\"\r\n}";

            ar = JsonConvert.DeserializeObject<Dictionary<string, string>>(arJson);
            aR = JsonConvert.DeserializeObject<Dictionary<string, string>>(arrJson);
            aM = JsonConvert.DeserializeObject<Dictionary<string, string>>(amJson);
            aS = JsonConvert.DeserializeObject<Dictionary<string, string>>(asJson);
        }
        string ci(string w)
        {
            var cY = 0;
            for (var i = 0; i < w.Length; i++)
            {
                if (i < w.Length && ao(w.ElementAt(i)))
                {
                    var j = 1;
                    while (v(w.ElementAt(i - j)))
                    {
                        if (i - j < 0) break;
                        if (i - j <= cY) break;
                        if (D(w.ElementAt(i - j - 1))) j += 2;
                        else break;
                    }
                    var R = w.substring(0, i - j);
                    R += w.ElementAt(i);
                    R += w.substring(i - j, i);
                    R += w.substring(i + 1, w.Length);
                    w = R;
                    cY = i + 1;
                    continue;
                }
                if (i < w.Length - 1 && D(w.ElementAt(i)) && w.ElementAt(i - 1) == 'র' && !D(w.ElementAt(i - 2)))
                {
                    var j = 1;
                    var aZ = 0;
                    while (true)
                    {
                        if (v(w.ElementAt(i + j)) && D(w.ElementAt(i + j + 1))) j += 2;
                        else if (v(w.ElementAt(i + j)) && ao(w.ElementAt(i + j + 1)))
                        {
                            aZ = 1;
                            break;
                        }
                        else break;
                    }
                    var R = w.substring(0, i - 1);
                    R += w.substring(i + j + 1, i + j + aZ + 1);
                    R += w.substring(i + 1, i + j + 1);
                    R += w.ElementAt(i - 1);
                    R += w.ElementAt(i);
                    R += w.substring(i + j + aZ + 1, w.Length);
                    w = R;
                    i += (j + aZ);
                    cY = i + 1;
                    continue;
                }
            }
            return w;
        }
        string fb = "0123456789ABCDEF";

        string fa(char d)
        {
            var h = fb.substr(d & 15, 1);
            while (d > 15)
            {
                d >>= 4;
                h = fb.substr(d & 15, 1) + h;
            }
            while (h.Length < 4) h = "0" + h;
            return h;
        }

        string bF(string line, bool ef)
        {
            var text = "";
            for (int i = 0; i < line.Length; i++)
            {
                if (eu(line.ElementAt(i))) text += line.ElementAt(i);
                else text += "&#" + (ef ? fa(line.ElementAt(i)).ToString() : line.charCodeAt(i).ToString()) + ";";
            }
            return text;
        }
        public string Convert(string line)
        {
            string az = "bangla";
            var G = ar;
            if (az == "bijoy") G = ar;
            else if (az == "somewherein") G = aM;
            else if (az == "boisakhi") G = aR;
            else if (az == "bangsee") G = aS;
            else if (az == "bornosoft")
            {
                return line;
            }
            else if (az == "phonetic")
            {
                return line;
            }
            else if (az == "htmlsafehex")
                return bF(line, true);
            else if (az == "htmlsafedec")
                return bF(line, false);

            line = line.replace("ো", "ো");
            line = line.replace("ৌ", "ৌ");
            line = ci(line);
            foreach (var eI in G)
            {
                line = line.replace(eI.Key, eI.Value);
            }
            return line;
        }

        bool bA(char e)
        {
            if (e == '০' || e == '১' || e == '২' || e == '৩' || e == '৪' || e == '৫' || e == '৬' || e == '৭' || e == '৮' || e == '৯') return true;
            return false;
        }

        bool ao(char e)
        {
            if (e == 'ি' || e == 'ৈ' || e == 'ে') return true;
            return false;
        }

        bool aJ(char e)
        {
            if (e == 'া' || e == 'ো' || e == 'ৌ' || e == 'ৗ' || e == 'ু' || e == 'ূ' || e == 'ী' || e == 'ৃ') return true;
            return false;
        }

        bool ah(char e)
        {
            if (ao(e) || aJ(e)) return true;
            return false;
        }

        bool v(char e)
        {
            if (e == 'ক' || e == 'খ' || e == 'গ' || e == 'ঘ' || e == 'ঙ' || e == 'চ' || e == 'ছ' || e == 'জ' || e == 'ঝ' || e == 'ঞ' || e == 'ট' || e == 'ঠ' || e == 'ড' || e == 'ঢ' || e == 'ণ' || e == 'ত' || e == 'থ' || e == 'দ' || e == 'ধ' || e == 'ন' || e == 'প' || e == 'ফ' || e == 'ব' || e == 'ভ' || e == 'ম' || e == 'শ' || e == 'ষ' || e == 'স' || e == 'হ' || e == 'য' || e == 'র' || e == 'ল' || e == 'য়' || e == 'ং' || e == 'ঃ' || e == 'ঁ' || e == 'ৎ') return true;
            return false;
        }

        bool Q(char e)
        {
            if (e == 'অ' || e == 'আ' || e == 'ই' || e == 'ঈ' || e == 'উ' || e == 'ঊ' || e == 'ঋ' || e == 'ঌ' || e == 'এ' || e == 'ঐ' || e == 'ও' || e == 'ঔ') return true;
            return false;
        }

        bool aF(char e)
        {
            if (e == 'ং' || e == 'ঃ' || e == 'ঁ') return true;
            return false;
        }

        bool bS(string e)
        {
            if (e == "্য" || e == "্র") return true;
            return false;
        }

        bool D(char e)
        {
            if (e == '্') return true;
            return false;
        }

        bool eT(char e)
        {
            if (bA(e) || ah(e) || v(e) || Q(e) || aF(e) || bS(e.ToString()) || D(e)) return true;
            return false;
        }

        bool eu(char e)
        {
            if (e >= 0 && e < 128) return true;
            return false;
        }

        bool cy(string e)
        {
            if (e == " " || e == "	" || e == "\n" || e == "\r") return true;
            return false;
        }

        string cJ(string e)
        {
            var t = "";
            if (e == "া") t = "আ";
            else if (e == "ি") t = "ই";
            else if (e == "ী") t = "ঈ";
            else if (e == "ু") t = "উ";
            else if (e == "ূ") t = "ঊ";
            else if (e == "ৃ") t = "ঋ";
            else if (e == "ে") t = "এ";
            else if (e == "ৈ") t = "ঐ";
            else if (e == "ো") t = "ও";
            else if (e == "ো") t = "ও";
            else if (e == "ৌ") t = "ঔ";
            else if (e == "ৌ") t = "ঔ";
            return t;
        }

        string bc(string e)
        {
            var t = "";
            if (e == "আ") t = "া";
            else if (e == "ই") t = "ি";
            else if (e == "ঈ") t = "ী";
            else if (e == "উ") t = "ু";
            else if (e == "ঊ") t = "ূ";
            else if (e == "ঋ") t = "ৃ";
            else if (e == "এ") t = "ে";
            else if (e == "ঐ") t = "ৈ";
            else if (e == "ও") t = "ো";
            else if (e == "ঔ") t = "ৌ";
            return t;
        }


    }

    public static class Ext
    {
        public static string substring(this string str, int from, int to)
        {
            return str.Substring(from, to - from);
        }

        public static string substr(this string str, int start, int length)
        {
            return str.Substring(start, length);
        }
        public static string replace(this string str, string pattern, string replacement)
        {
            return Regex.Replace(str, pattern, replacement);
        }
        public static int charCodeAt(this string str, int index)
        {
            return str.ElementAt(index);
        }
    }
}